Tekla Open API Reference for Tekla Structures 2025
ProfileItem.IsHardcodedProfile Property
 Whether the profile is a parametric user-defined hard coded profile.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsHardcodedProfile { get; }
Public ReadOnly Property IsHardcodedProfile As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace